Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Vulintus HabiTrak V1.0 (SAMD51P)
# ------------------------------
vulintus_habitrak_v1_0.name=Vulintus HabiTrak V1.0 (SAMD51P)
vulintus_habitrak_v1_0.build.board=HABITRAK_V1_0
vulintus_habitrak_v1_0.build.usb_manufacturer="Vulintus, Inc."
vulintus_habitrak_v1_0.build.usb_product="Vulintus HabiTrak V1.0"

vulintus_habitrak_v1_0.vid.0=0x239A
vulintus_habitrak_v1_0.pid.0=0x8031
vulintus_habitrak_v1_0.vid.1=0x239A
vulintus_habitrak_v1_0.pid.1=0x0031
vulintus_habitrak_v1_0.vid.1=0x239A
vulintus_habitrak_v1_0.pid.1=0x0032
vulintus_habitrak_v1_0.upload.tool=bossac18
vulintus_habitrak_v1_0.upload.protocol=sam-ba
vulintus_habitrak_v1_0.upload.maximum_size=520192
vulintus_habitrak_v1_0.upload.offset=0x4000
vulintus_habitrak_v1_0.upload.use_1200bps_touch=true
vulintus_habitrak_v1_0.upload.wait_for_upload_port=true
vulintus_habitrak_v1_0.upload.native_usb=true
vulintus_habitrak_v1_0.build.core=arduino
vulintus_habitrak_v1_0.build.extra_flags=-D__SAMD51P19A__ -DVULINTUS_HABITRAK_V1_0 -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak_v1_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_habitrak_v1_0.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
vulintus_habitrak_v1_0.build.variant=habitrak_v1_0
vulintus_habitrak_v1_0.build.variant_system_lib=
vulintus_habitrak_v1_0.build.vid=0x239A
vulintus_habitrak_v1_0.build.pid=0x8031
vulintus_habitrak_v1_0.build.mcu=cortex-m4
vulintus_habitrak_v1_0.build.f_cpu=120000000L
vulintus_habitrak_v1_0.build.cache_flags=-DENABLE_CACHE
vulintus_habitrak_v1_0.build.flags.optimize=-Os
vulintus_habitrak_v1_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_habitrak_v1_0.build.flags.debug=-g
vulintus_habitrak_v1_0.bootloader.tool=openocd
vulintus_habitrak_v1_0.bootloader.file=vulintus_samd/binaries/sam_ba_SAMD51P19A.bin
vulintus_habitrak_v1_0.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16


# Vulintus Liquid Dispenser V2.0 (SAMD21G17A)
# ------------------------------
vulintus_liquid_dispenser_v2_0.name=Vulintus Liquid Dispenser V2.0 (SAMD21G17A)
vulintus_liquid_dispenser_v2_0.build.board=LIQUID_DISPENSER_V2_0
#vulintus_liquid_dispenser_v2_0.build.board=SAMD_ZERO
vulintus_liquid_dispenser_v2_0.build.usb_manufacturer="Vulintus, Inc."
vulintus_liquid_dispenser_v2_0.build.usb_product="Vulintus Liquid Dispenser V2.0"
vulintus_liquid_dispenser_v2_0.vid.0=0x16D0
vulintus_liquid_dispenser_v2_0.pid.0=0x5557
vulintus_liquid_dispenser_v2_0.vid.1=0x16D0
vulintus_liquid_dispenser_v2_0.pid.1=0x5856
vulintus_liquid_dispenser_v2_0.vid.2=0x16D0
vulintus_liquid_dispenser_v2_0.pid.2=0x5B41
vulintus_liquid_dispenser_v2_0.vid.3=0x16D0
vulintus_liquid_dispenser_v2_0.pid.3=0x5B40
vulintus_liquid_dispenser_v2_0.vid.4=0x16D0
vulintus_liquid_dispenser_v2_0.pid.4=0x5A0C
vulintus_liquid_dispenser_v2_0.vid.5=0x16D0
vulintus_liquid_dispenser_v2_0.pid.5=0x5856
vulintus_liquid_dispenser_v2_0.upload.maximum_size=122880
vulintus_liquid_dispenser_v2_0.upload.protocol=sam-ba
vulintus_liquid_dispenser_v2_0.upload.tool=bossac18
vulintus_liquid_dispenser_v2_0.upload.use_1200bps_touch=true
vulintus_liquid_dispenser_v2_0.upload.wait_for_upload_port=true
vulintus_liquid_dispenser_v2_0.upload.native_usb=true
vulintus_liquid_dispenser_v2_0.build.core=arduino
vulintus_liquid_dispenser_v2_0.build.variant=liquid_dispenser_v2_0
vulintus_liquid_dispenser_v2_0.build.variant_system_lib=
vulintus_liquid_dispenser_v2_0.build.vid=0x16D0
vulintus_liquid_dispenser_v2_0.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
vulintus_liquid_dispenser_v2_0.build.buildconfig=CONFIG_H_DISABLED
vulintus_liquid_dispenser_v2_0.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
vulintus_liquid_dispenser_v2_0.build.timerconfig=TIMER_732Hz
vulintus_liquid_dispenser_v2_0.build.mcu=cortex-m0plus
vulintus_liquid_dispenser_v2_0.build.mathlib=arm_cortexM0l_math
vulintus_liquid_dispenser_v2_0.build.f_cpu=48000000L
vulintus_liquid_dispenser_v2_0.build.usb_product="D21"
vulintus_liquid_dispenser_v2_0.build.extra_flags=-D__SAMD21G17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
vulintus_liquid_dispenser_v2_0.build.ldscript=flash_128KB.ld
vulintus_liquid_dispenser_v2_0.build.openocdscript=openocd_scripts/SAMD21G17A.cfg
vulintus_liquid_dispenser_v2_0.build.bootloader_size=__8KB_BOOTLOADER__
vulintus_liquid_dispenser_v2_0.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
vulintus_liquid_dispenser_v2_0.bootloader.file=vulintus_samd/binaries/sam_ba_SAMD21G17A.bin
vulintus_liquid_dispenser_v2_0.bootloader.tool=openocd